import {TData} from "@/types/types";

export const booksArray: TData[] = [
    {
        title: 'Идеальный программист. Как стать профессионалом разработки ПО',
        author: 'Роберт Мартин',
        year: 2011,
        rate: 5,
        number: '978-5-459-01044-2',
    },
    {
        title: 'Практическое руководство по винокурению',
        author: 'Павел Иевлев',
        year: 2021,
        rate: 5,
        number: '978-5-04-088830-6',
    },
    {
        title: '7 навыков высокоэффективных людей',
        author: 'Стивен Кови',
        year: 1989,
        rate: 5,
        number: '978-5-9614-2021-0',
    },
    {
        title: 'Цвет волшебства',
        author: 'Терри Пратчетт',
        year: 2011,
        rate: 5,
        number: '978-5-699-15629-0',
    },
    {
        title: 'Психбольница в руках пациентов',
        author: 'Алан Купер',
        year: 2004,
        rate: 4,
        number: '978-5-4461-0674-5',
    },
    {
        title: 'Интрижки мишки',
        author: 'Елена Галенко',
        year: 2021,
        rate: 4,
    },
    {
        title: 'Чистый код: создание, анализ и рефакторинг',
        author: 'Роберт Мартин',
        year: 2018,
        rate: 5,
        number: '978-5-496-00487-9',
    },
    {
        title: 'Джордж и Большой взрыв',
        author: 'Стивен Хокинг',
        authorSecond: 'Люси Хокинг',
        year: 2011,
        rate: 5,
        number: '978-5-4370-0089-2',
    },
];